{
  "en": {
    "home": "Home",
    "experiences": "Experiences",
    "contact": "Contact",
    "skills": "Skills",
    "projects": "Projects",
    "services": "Services",
    "projects_title": "Projects",
    "project_1_title": "OpenCart Upgrade Project - Fuel Cell Store",
    "project_1_duration": "Mar 2024 - Sep 2024",
    "project_1_desc1": "Upgraded the company’s e-commerce platform from OpenCart 1.5.6.4 to OpenCart 3.0.3.8, ensuring a seamless transition while preserving existing functionalities.",
    "project_1_desc2": "Refactored the codebase to improve performance, strengthen security, and enhance scalability, addressing compatibility issues with third-party modules along the way.",
    "project_1_desc3": "Integrated new features such as improved product management tools and an optimized checkout process, while also refining the frontend for better user experience and mobile responsiveness.",

    "project_2_title": "Internal ERP (Enterprise Resource Planning) System - Fuel Cell Store",
    "project_2_duration": "Sep 2023 - Feb 2024",
    "project_2_desc1": "Built a comprehensive internal ERP system, 'Onyx,' designed to streamline business operations and improve efficiency across multiple departments.",
    "project_2_desc2": "Developed a centralized dashboard for managing core processes, including order tracking, inventory control, and shipment monitoring, offering quick access to essential data.",
    "project_2_desc3": "Implemented automated reporting and analytics, allowing for custom reports on inventory, order status, and audit trails, which supported data-driven decision-making.",
    "project_2_desc4": "Implemented automated backups through cron jobs, ensuring data security and system reliability by reducing the need for manual processes.",

    "project_3_title": "Inventory System - Fuel Cell Store",
    "project_3_duration": "Oct 2024 - Present",
    "project_3_desc1": "Developed a robust inventory management system to efficiently track and manage stock levels, supplier details, and order fulfillment status.",
    "project_3_desc2": "Designed an intuitive interface to enable quick stock adjustments, efficient stock audits, and minimize human errors in stock handling.",
    "project_3_desc3": "Integrated real-time analytics and reporting features, providing insights into inventory turnover, stock aging, and demand forecasting.",
    "project_3_desc4": "Automated reorder alerts and linked inventory levels with the ERP system, ensuring seamless operations and avoiding stockouts.",

    "project_4_title": "Website Design and Implementation - Laplace Investment",
    "project_4_duration": "July 2023 - Aug 2023",
    "project_4_desc1": "Created a modern, responsive design optimized for both mobile and desktop, with a focus on a clean and professional aesthetic.",
    "project_4_desc2": "Improved navigation flow and UI elements, enabling users to access key features and data with ease.",
    "project_4_desc3": "Collaborated with stakeholders to align design elements with brand identity, ensuring a cohesive user experience across all interfaces."
  },
  "zh": {
    "home": "主页",
    "experiences": "经验",
    "contact": "联系",
    "skills": "技能",
    "projects": "项目",
    "services": "服务",
    "projects_title": "项目",
    "project_1_title": "OpenCart 升级项目 - 燃料电池商店",
    "project_1_duration": "2024年3月 - 2024年9月",
    "project_1_desc1": "将公司电子商务平台从 OpenCart 1.5.6.4 升级到 OpenCart 3.0.3.8，确保在保留现有功能的同时顺利过渡。",
    "project_1_desc2": "重构代码库以提高性能、加强安全性并增强可扩展性，同时解决第三方模块的兼容性问题。",
    "project_1_desc3": "集成了新的功能，如改进的产品管理工具和优化的结账流程，同时优化了前端以提升用户体验和移动端响应能力。",

    "project_2_title": "内部 ERP（企业资源规划）系统 - 燃料电池商店",
    "project_2_duration": "2023年9月 - 2024年2月",
    "project_2_desc1": "构建了一个综合性的内部 ERP 系统 'Onyx'，旨在简化业务操作并提高多个部门的效率。",
    "project_2_desc2": "开发了一个集中仪表板，用于管理核心流程，包括订单跟踪、库存控制和发货监控，提供快速访问关键数据。",
    "project_2_desc3": "实现了自动化报告和分析，支持自定义库存、订单状态和审计报告，为数据驱动决策提供支持。",
    "project_2_desc4": "通过 cron 任务实现了自动备份，确保数据安全并提高系统可靠性，减少手动流程的需求。",

    "project_3_title": "库存系统 - 燃料电池商店",
    "project_3_duration": "2024年10月 - 至今",
    "project_3_desc1": "开发了一个强大的库存管理系统，用于高效地跟踪和管理库存水平、供应商信息和订单履行状态。",
    "project_3_desc2": "设计了直观的界面，使库存调整和审计更加高效，并最大限度地减少了库存操作中的人为错误。",
    "project_3_desc3": "集成了实时分析和报告功能，提供库存周转率、库存老化和需求预测的洞察。",
    "project_3_desc4": "自动化了补货提醒，并将库存水平与 ERP 系统连接，确保操作顺畅，避免缺货情况。",

    "project_4_title": "网站设计与实施 - Laplace Investment",
    "project_4_duration": "2023年7月 - 2023年8月",
    "project_4_desc1": "创建了现代、响应式设计，优化了移动和桌面体验，注重清晰且专业的美学。",
    "project_4_desc2": "改善了导航流程和UI元素，使用户能够轻松访问关键功能和数据。",
    "project_4_desc3": "与利益相关者合作，以品牌形象为导向，确保跨所有界面的统一用户体验。"
  }
}
